In [2]:
import pandas as pd

In [6]:
lista = [1, 2, 3, 4, 5]

In [10]:
df = pd.Series(data=lista, index=["A", "B", "C", "D", "E"])

In [11]:
df

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [17]:
df.loc["A"]

1

In [18]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [21]:
df.index.to_list()

['A', 'B', 'C', 'D', 'E']

In [22]:
minha_series = pd.Series(lista)

In [23]:
minha_series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [25]:
minha_series[3]

4

In [26]:
minha_series.to_list()

[1, 2, 3, 4, 5]

In [27]:
minha_series.tolist()

[1, 2, 3, 4, 5]

In [28]:
minha_series2 = pd.Series(data=[elemento**2 for elemento in lista])

In [29]:
minha_series2

0     1
1     4
2     9
3    16
4    25
dtype: int64

In [30]:
minha_series3 = minha_series2[minha_series2 > 2]

In [31]:
minha_series3

1     4
2     9
3    16
4    25
dtype: int64

In [35]:
minha_series3 = minha_series2[(minha_series2 > 2) & (minha_series2 < 20)]

In [36]:
minha_series3

1     4
2     9
3    16
dtype: int64

In [44]:
df1 = pd.DataFrame()
df1["Coluna 1"] = minha_series
df1["Coluna 2"] = minha_series2
df1["Coluna 3"] = minha_series2**2

In [47]:
df1

   Coluna 1  Coluna 2  Coluna 3
0         1         1         1
1         2         4        16
2         3         9        81
3         4        16       256
4         5        25       625

In [50]:
dicionario = {"Coluna 1": [1, 2, 3, 4],
             "Coluna 2": [1, 4, 9, 16],
             "Coluna 3": [1, 16, 27, 64]}
df2 = pd.DataFrame(dicionario)
df2

   Coluna 1  Coluna 2  Coluna 3
0         1         1         1
1         2         4        16
2         3         9        27
3         4        16        64

In [51]:
df2["Coluna 1"][2]

3

In [52]:
df2["Coluna 2"][3]

16

In [62]:
df2[["Coluna 1", "Coluna 2"]]

   Coluna 1  Coluna 2
0         1         1
1         2         4
2         3         9
3         4        16

In [63]:
df2

   Coluna 1  Coluna 2  Coluna 3
0         1         1         1
1         2         4        16
2         3         9        27
3         4        16        64

In [65]:
df2.iloc[1]

Coluna 1     2
Coluna 2     4
Coluna 3    16
Name: 1, dtype: int64

In [76]:
df2.loc[:1, ["Coluna 1", "Coluna 2"]]

   Coluna 1  Coluna 2
0         1         1
1         2         4

In [78]:
df2

   Coluna 1  Coluna 2  Coluna 3
0         1         1         1
1         2         4        16
2         3         9        27
3         4        16        64

In [84]:
df2.loc[1:2, ["Coluna 1", "Coluna 3"]]

   Coluna 1  Coluna 3
1         2        16
2         3        27